yukebrillianth/triagebox_esp32_node/sdkconfig.defaults
# Without this a fresh clone defaults to target "esp32" and the build dies on the
# BSP manifest before compiling anything ("not compatible with target esp32").
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_LV_USE_CHART=y
CONFIG_LV_USE_THEME_DEFAULT=y
CONFIG_LV_USE_OBJ_NAME=y
CONFIG_LV_USE_TRANSLATION=y
CONFIG_LV_USE_TINY_TTF=y
CONFIG_LV_TINY_TTF_FILE_SUPPORT=y
CONFIG_LV_USE_FS_STDIO=n
# 50 tiny_ttf fonts blow the 64 KB LV_MEM builtin pool; clib malloc reaches the
# ESP heap (PSRAM-backed above CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL).
CONFIG_LV_USE_CLIB_MALLOC=y
# Without LV_USE_LOG an LV_ASSERT_MALLOC failure is a silent while(1) hang.
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_LEVEL_WARN=y
CONFIG_LV_LOG_PRINTF=y
CONFIG_ESP_TASK_WDT_INIT=n
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
# UART0's default console pins ARE the RS485 pins (boot log: "GPIO 44 and 43 are
# used as console UART I/O pins"), so every log line would be injected onto the
# STM32 link. Console goes to USB Serial/JTAG only; idf.py monitor still works
# over the same USB-C.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=n
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
# Debug console (rfid/vital/status/btn/stats over USB) so the triage flow can be
# demoed and profiled without the STM32. TURN THIS OFF before any real patient
# use: it lets anyone on the USB port fake vital signs.
CONFIG_TB_DEBUG_CONSOLE=y
